#!/bin/bash
echo -n  "Comfirm continue！(y/n)"
read confirm
if [ "y" != "$confirm" ] ;then
   exit 0
fi

#$.记录脚本执行开始时间
startTime=`date +%s`
echo "Start Time ：$(date '+%Y-%m-%d %H:%M:%S')"


#$.检测是否可以安装
# -------------------------------------------------------------------------------
# 系统是否centos
# 是否root用户
# ip配置文件是否合法
# 检测依赖的exp和sh文件是否存在
# 
# 
# 
# -------------------------------------------------------------------------------



#$.初始化
# -------------------------------------------------------------------------------
# mount根据系统调整
# 
# 
# 
# 
# -------------------------------------------------------------------------------




#$.安装公用配置
# -------------------------------------------------------------------------------
# 主机名
# hosts
# 防火墙
# SElinux
# 时间同步
# ssh免登陆
# jdk
# -------------------------------------------------------------------------------




#$.安装ambari
# -------------------------------------------------------------------------------
# 挂载系统iso镜像文件，安装expect 和httpd
# yum源
# httpd
# 数据库安装 
#-------------------------------------------------------------------------------



#$.结束
endTime=`date +%s`

echo "结束时间：$(date '+%Y-%m-%d %H:%M:%S')"

spend=`expr $endTime - $startTime`
echo "完成自动配置耗时：$spend秒"
echo "请手动执行ambari-server setup"